publications.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-12-05 Fri 17:55 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Sebastian Halbig" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./tufte.css" type="text/css" />

</head>
<body>
<article id="content" class="content">
<p>

<div class="header">
  <span class="title" id="title-left"><a href="index.html">Sebastian Halbig</a></span>
  <span class="nav-links" id="title-right">
    <a href="publications.html">Publications</a>
    <a href="teaching.html">Teaching</a>
    <a href="games/braid-trivialiser.html">Math games</a>
    <a href="cv.html">CV</a>
  </span>
</div>

</p>

<p>
Preprints of articles by my coauthors and me can be found on the <a href="https://arxiv.org/search/?query=Halbig%2C+Sebastian&amp;searchtype=author&amp;abstracts=show&amp;order=-announced_date_first&amp;size=50">arXiv</a>.
Reviews and an overview of all published articles are on <a href="https://zbmath.org/authors/halbig.sebastian">zbMATH</a>.
</p>
<section id="outline-container-org7925b9e" class="outline-2">
<h2 id="org7925b9e"><span class="section-number-2">1.</span> Preprints</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7f16d57" class="outline-4">
<h4 id="org7f16d57"><span class="section-number-4">1.0.1.</span> C. Lomp and S. Halbig. <a href="https://arxiv.org/abs/2511.11047">Irreducible representations of generalised Kac–Paljutkin Hopf algebras.</a> (2025).</h4>
<div class="outline-text-4" id="text-1-0-1">
<p>
Generalised Kac–Paljutkin algebras were introduced by Christian Lomp as crossed products of two group algebras. These are  semisimple, non-commutative, non-cocommutative finite-dimensional Hopf algebras.
In this note, we show that generalised Kac–Paljutkin algebras are isomorphic as algebras (but not as Hopf algebras) to group algebras.
This we use to classify their simple representations in terms of tuples of Young tableaux.
</p>
</div>
</div>
<div id="outline-container-org99c01cb" class="outline-4">
<h4 id="org99c01cb"><span class="section-number-4">1.0.2.</span> U. Krähmer and S. Halbig. <a href="https://arxiv.org/abs/2506.09249">A non-semisimple Kitaev lattice model</a>. (2025).</h4>
<div class="outline-text-4" id="text-1-0-2">
<p>
A major problem in quantum computing is that quantum states cannot be copied, which implies that classical error-correction strategies cannot be applied.
An ingenious solution to this issue was proposed by A. Kitaev by combining topological properties of surfaces with the representation theory of Drinfeld doubles of group algebras. This model, now known as the Kitaev (quantum double) model, is one of the most-studied proposals for topological quantum computing and has seen various generalisations.
Despite its extensive investigation however, the algebraic side of the model was so far always assumed to be semisimple.
</p>

<p>
In our joint work, we develop a non-semisimple analogue for the Kitaev model. This comes with some notable changes compared to the classical approach:
</p>
<ul class="org-ul">
<li>We introduce coefficients (involutive Hopf bimodules) to the model.
These are closely related to structures arising in Hopf-cyclic homology.
These can be chosen to be trivial if and only if the antipode of the Hopf algebra squares to the identity and in this case one recovers the classical (semisimple) Kitaev model.</li>
<li>The projectors onto invariant subspaces are replaced by bitensor products.
These measure the difference between the coinvariant subspace (with respect to the coaction) and invariant subspace (with respect to the action) of a Yetter–Drinfeld module.</li>
<li>Topological invariance is established via a Mayer–Vietoris-type sequence which tracks how gluing surfaces togther affects the algebraic side of the model.</li>
</ul>

<p>
A particularly interesting choice for the algebraic input datum of the theory are small quantum groups and, more generally, bosonisations of Nichols algebras. In this setting, we develop a reduction formalism, allowing to compute the topologically protected spaces of the models in terms of the representations of the Cartan part.
</p>
</div>
</div>
<div id="outline-container-orgd98eb26" class="outline-4">
<h4 id="orgd98eb26"><span class="section-number-4">1.0.3.</span> S. Halbig and T. Zorman. <a href="https://arxiv.org/abs/2301.03545">Duality in Monoidal Categories</a>. (2023).</h4>
<div class="outline-text-4" id="text-1-0-3">
<p>
A module over a commutative ring is finitely-generated projective  if and only if tensoring with this module is left adjoint to tensoring with its dual.
Finitely-generated modules have many favourable properties; for example, they admit dual bases, which can be used to take traces of endomorphism.
In categorical terms, finitely-generated modules are the rigidly dualisable objects of the representation category of a commutative ring.
C. Heunen raised the question whether the rigidly dualisable objects of a monoidal category coincide with the "tensor-representable" objects; objects such that tensoring with them is left adjoint to tensoring with a "dual" object.
We answer his question in the negative and show that for \(\mathfrak{sl}_{2}\)-crystals all objects are tensor-representable but only direct sums of the monoidal unit are rigidly dualisable.
</p>
</div>
</div>
</section>
<section id="outline-container-org9beed48" class="outline-2">
<h2 id="org9beed48"><span class="section-number-2">2.</span> Published articles</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgee35afe" class="outline-4">
<h4 id="orgee35afe"><span class="section-number-4">2.0.1.</span> B. Femić and S. Halbig. <a href="https://doiserbia.nb.rs/Article.aspx?ID=0350-13022531001F">Categorical centers and Yetter–Drinfel`d-modules as 2-categorical (bi)lax structures</a>. Publ. Inst. Math., Nouv. Sér. (2025).</h4>
<div class="outline-text-4" id="text-2-0-1">
<p>
By considering the delooping of a monoidal category, we identify its Drinfeld centre with the category of pseudonatural transformations of the identity functor.
This idea is then extended to incorporate centres of bimodule categories, allowing to explain the "dual" bimodule categories studied by T. Zorman and me  in <i>Pivotality, twisted centres and the anti-double of a Hopf monad</i>.
</p>
</div>
</div>
<div id="outline-container-org0ce0959" class="outline-4">
<h4 id="org0ce0959"><span class="section-number-4">2.0.2.</span> S. Halbig and T. Zorman. <a href="https://link.springer.com/article/10.1007/s10485-024-09778-9">Diagrammatics for Comodule Monads</a>. Appl. Categ. Struct. (2023).</h4>
<div class="outline-text-4" id="text-2-0-2">
<p>
S. Willteron introduced a diagrammatical calculus to study Hopf monads.
We extend it to incorporate comodule monads—the monadic version of comodule algebras—and use it to establish a bijection between the comodoule monad structures on a monad and the module category structures on its Eilenberg–Moore category.
</p>
</div>
</div>
<div id="outline-container-org9639605" class="outline-4">
<h4 id="org9639605"><span class="section-number-4">2.0.3.</span> S. Halbig and T. Zorman. <a href="http://www.tac.mta.ca/tac/volumes/41/4/41-04abs.html">Pivotality, twisted centres and the anti-double of a Hopf monad</a>. Theory Appl. Categ. (2024).</h4>
<div class="outline-text-4" id="text-2-0-3">
<p>
The coefficients of Hopf cyclic homology form the category of stable anti-Yetter–Drinfeld modules.
If the underlying Hopf algebra is finite-dimensional, the anti-Yetter–Drinfeld modules can be identified with the representations of the anti-Drinfeld double.
In this setting the following are equivalent:
</p>
<ul class="org-ul">
<li>the Drinfeld and anti-Drinfeld double are isomorphic as algebras,</li>
<li>there exists a one-dimensional anti-Yetter–Drinfeld module, and</li>
<li>the square of the antipode is implemented by a combined adjoint action of a group-like and a character.</li>
</ul>
<p>
This yields in particular a classification of the pivotal elements of the Drinfeld double of the Hopf algebra and has therefore applications in areas such as TQFTs.
</p>

<p>
In this work, we generalise the above correspondence to arbitrary monoidal categories using the language of braided module categories.
As in the Hopf algebraic case, we construct a canonical map between invertible objects in the anti-centre (the analogue of one-dimensional anti-Yetter–Drinfeld modules) and pivotal structures on the Drinfeld centres.
By considering an example coming from knot-theory, we show that this map needs not be surjective, thereby answering a question of Shimizu.
To reconcile the categorical with the Hopf algebraic picture, we provide a Hopf monadic interpretation of our findings.
</p>
</div>
</div>
<div id="outline-container-org7f6f53b" class="outline-4">
<h4 id="org7f6f53b"><span class="section-number-4">2.0.4.</span> S. Halbig. <a href="https://www.tandfonline.com/doi/full/10.1080/00927872.2021.1939043">Generalized Taft algebras and pairs in involution</a>. Commun. Algebra. (2021).</h4>
<div class="outline-text-4" id="text-2-0-4">
<p>
For a finite-dimensional Hopf algebra, it is a natural question to ask if the square of the antipode satisfies an analogue of Radford's S⁴-formula. Equivalently: is its Drinfeld double always pivotal?
By studying bosonisations of Nichols algebras of diagonal type over abelian groups, this question translates to the solvability  of Diophantine equations.
We show that some of these equations do not admit any solutions and therefore not all Drinfeld doubles are pivotal.
</p>
</div>
</div>
<div id="outline-container-orgb948b55" class="outline-4">
<h4 id="orgb948b55"><span class="section-number-4">2.0.5.</span> S. Halbig and U. Krähmer <a href="https://link.springer.com/chapter/10.1007/978-3-030-34072-8_14">A Hopf algebra without a modular pair in involution</a>. Geom. Methods in Physics XXXVII. (2019).</h4>
<div class="outline-text-4" id="text-2-0-5">
<p>
Modular pairs in involution are the one-dimensional coefficients of Hopf-cyclic homology. Hajac raised the question whether all finite-dimensional Hopf algebras admit such pairs. We show that there are Hopf algebras of dimension \(p^{3}\) for \(p\) a prime answer where this is not the case.
</p>
</div>
</div>
</section>
<section id="outline-container-org2dc1f56" class="outline-2">
<h2 id="org2dc1f56"><span class="section-number-2">3.</span> Other publications</h2>
<div class="outline-text-2" id="text-3">
<p>
A digital version of my PhD thesis, written under the supervision of <a href="https://tu-dresden.de/mn/math/geometrie/kraehmer">Ulrich Krähmer</a> can be found <a href="https://tud.qucosa.de/api/qucosa%3A80342/attachment/ATT-0/">here</a>.
</p>
</div>
</section>
</article>
<footer id="postamble" class="status">
<p class="author">Author: Sebastian Halbig</p>
<p class="date">Created: 2025-12-05 Fri 17:55</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</footer>
</body>
</html>
